[
  {
    "title": "First Review",
    "notes": [
      "Demo tape featuring <i>Take Me</i>, <i>Colour My Life</i> and <i>See the Sun</i> recorded at Abraham Moss Studio in Cheetham Hill, Manchester some time in the Fall of 1991",
      "First recording with Noel Gallagher",
      "The demo tape was mailed to the City Life office for review some time in the Fall of 1991",
      "Chris Sharratt reviewed Oasis's first demo tape for the December, 1991 issue of <i>City Life</i> (issue #192).",
      "Review mentions <i>Colour My Life</i> and <i>Take Me</i>"
    ],
    "sources": [
      {
        "title": "Pre-Definitely Maybe Recordings",
        "url": "https://monobrowdemos.wordpress.com/pre-definitely-maybe/"
      },
      {
        "title": "It Was 30 Years Ago Today...Looking Back On My Oasis Demo Review",
        "url": "https://medium.com/the-riff/it-was-30-years-ago-today-looking-back-on-my-1991-oasis-demo-review-8069c94e8f00"
      }
    ]
  },
  {
    "title": "Swirl Logo Creation",
    "notes": [
      "The original Oasis Union Jack swirl logo is created by Tony French some time in the Spring of 1993.",
      "The logo is commissioned by Noel Gallagher for use on the <i>Live Demonstration</i> tape, which contains recordings from the the session at Porter Street Studio in Liverpool, UK with the Real People, also in the Spring of 1993.",
      "This all occurs prior to the famous King Tuts gig on May 31, 1993."
    ],
    "sources": [
      {
        "title": "Oasis Band Logo History by Brian Cannon",
        "url": "https://www.youtube.com/watch?v=y5gBUJEGHMw&t=77s"
      }
    ]
  },
  {
    "title": "Definitely Maybe Monnow Valley Recording Session",
    "notes": [
      "The band had gigs all the way up through December 16, 1993.",
      "Tony McCarroll states in his book that they were at Monnow Valley after they heard Columbia on the radio for the first time.  The white label demo was aired on December 6, 1993 on BBC Radio One.",
      "He also states that the session lasted 18 days.",
      "The band recorded Supersonic at The Pink Museum in Liverpool on December 19, 1993, so they wouldn't have been at Monnow Valley at that time.",
      "The band recorded a session for BBC Radio One on December 22, 1993 at Maida Vale Studios which was later broadcast on January 4th 1994.",
      "Liam Gallagher is on vacation in Tenerife, Spain from December 26th - 28th, 1993.",
      "The cover for Supersonic single was shot at Monnow Valley Studios on January 26, 1994.",
      "The band played their famous gig at Water Rats in London on January 27.",
      "Tentative dates for the session are January 7, 1994 to January 26, 1994."
    ],
    "sources": [
      {
        "title": "Oasis: The Truth",
        "url": "https://johnblakebooks.com/oasis-the-truth.html"
      },
      {
        "title": "Liam Gallagher Boarding Pass",
        "url": "https://www.oasis-timeline.com/images/sources/liam_gallagher_boarding_pass_1993.jpg"
      }
    ]
  },
  {
    "title": "Definitely Maybe Sawmill Studios Recording Session",
    "notes": [
      "The band played their famous gig at Water Rats in London on January 27.",
      "The band didn't head to Sawmill Studios sometime until after the Water Rates gig.  Tony McCarroll states in his book that they went from London back to Manchester for one day and then down to Sawmill Studios.",
      "Paolo Hewitt states in Getting High that the band went to Olympic Studios to mix the Monnow Valley sessions for a couple days before they realized it wasn't going to work.",
      "Anjali Dutt (engineer on the sessions) stated that the Sawmill Studios session didn't start until after the Gleneagles gig (February 6th, 1994) AND the Amsterdam ferry incident (February 17th, 1994).",
      "Oasis resuming touring on March 23rd, 1994 in Bedford, UK.  Therefore, the sessions most likely ran from some time after February 17th until some time in mid-March.",
      "Tentative dates for the session are February 24, 1994 to March 4, 1994."
    ],
    "sources": [
      {
        "title": "Oasis Recording Info: It’s Getting Better: The Sawmills Sessions",
        "url": "http://www.oasis-recordinginfo.co.uk/?page_id=137"
      },
      {
        "title": "Getting High: The Adventures of Oasis",
        "url": "https://deanstreetpress.co.uk/pages/book_page/19"
      },
      {
        "title": "Oasis: The Truth",
        "url": "https://johnblakebooks.com/oasis-the-truth.html"
      },
      {
        "title": "Live4Ever Forum - Who Sings Gonna Live Forever",
        "url": "https://live4ever.proboards.com/post/1433535/thread"
      }
    ]
  },
  {
    "title": "Definitely Maybe Eden Studios Mixing Session",
    "notes": [
      "Mark Coyle and Anjuli Dutt attempt to mix the output of the <i>Definitely Maybe</i> Sawmills Studios recording session at Eden Studios in Chiswick, London, UK.",
      "The recording session at Sawmill Studios most likely lasted until March 4th, 1994.",
      "Owen Morris remixes <i>Rock n Roll Star</i> and <i>Columbia</i> at Loco Studios in Wales on April 23/April 24, 1994.",
      "Most likely dates for the Eden Studios mixing session is March 7th to March 25th, 1994."
    ],
    "sources": [
      {
        "title": "Uncut Magazine - Oasis' Definitely Maybe 20 years on...",
        "url": "https://www.uncut.co.uk/features/oasis-definitely-maybe-20-years-on-8536/"
      },
      {
        "title": "Recording Your Music - Owen Morris on Mixing Definitely Maybe",
        "url": "http://recordingyourmusic.blogspot.com/2016/07/owen-morris-on-mixing-definitely-maybe.html"
      },
      {
        "title": "Live4Ever Forum - Who Sings Gonna Live Forever",
        "url": "https://live4ever.proboards.com/post/1433535/thread"
      }
    ]
  },
  {
    "title": "Shakermaker Video Shoot",
    "notes": [
      "The video is filmed at three distinct locations:  8 Stratford Avenue in Didsbury (Bonehead's old house), Fog Lane Park and obviously Sifter's Records, all of which are within a 2 mile radius of each other.",
      "There may even be a few shots in front of Noel and Liam's childhood house on Cranwell Drive in neighboring Burnage.",
      "Based on the flowers and grass visible during the shots in Bonehead's back garden, the video appears to have been filmed in the springtime or early summer, 1994.",
      "A check of the band's touring schedule shows that they were on a break from May 15th to June 1, 1994.  They were also on a break from April 14th to April 28th, 1994, but based on the greenery in the video, I am guessing the May timeline makes more sense.",
      "The cover to Definitely Maybe is photographed on May 27th at Bonehead's house, so the video shoot would have been on a different day and quite possibly around the same time for logistical reasons.",
      "The video was released on June 13th.  As this was their second music video and prior to the release of Definitely Maybe, it most likely did not have a huge budget and was probably filmed in one day.",
      "Likely filming date is some time during the last week of May, 1994"
    ],
    "sources": [

    ]
  },
  {
    "title": "Shakermaker Single Cover Shoot",
    "notes": [
      "Shot in Michael Spencer Jones' apartment on Clyde Road, West Didsbury, Manchester, UK in the Spring of 1994."
    ],
    "sources": [
      {
        "title": "Oasis photographer Michael Spencer Jones: how it started, photographing Shakermaker cover",
        "url": "https://www.youtube.com/watch?v=QnXfSJ1el0E"
      }
    ]
  },
  {
    "title": "Supersonic (US) Video Shoot",
    "notes": [
      "Parts of the video were shot at the Cabazon Dinosaurs in Cabazon, CA (east of Lost Angeles near Palm Springs, CA).",
      "As part of the US tour, Oasis arrived in Los Angeles, CA on either September 27th or 28th ahead of the show at the Whiskey A Go Go.",
      "Epic Records throws a party for Oasis on the afternoon of the Whiskey A Go Go gig (September 29th, 1994).",
      "Oasis played there ill-fated concert at the Whiskey A Go Go on September 29, 1994.",
      "At some point during the tour, Gugisy sends his sister Mary a post card mentioning that the band just filmed the music video.  However, the only visible postcard has an October 6th postmark.",
      "Noel Gallagher famously quits the band that night and spends at least 3 days in San Francisco with Melissa Lim.",
      "Noel Gallagher goes to Las Vegas, NV with Tim Abbot of Creation Records for a few more days.",
      "Oasis took part in a recording session at The Congress House in Austin, TX on October 8, 1994 after Noel rejoined the band.",
      "Oasis US tour resumed in Minneapolis, MN on October 14th, 1994.",
      "The music video is released on November 15th, 1994."
    ],
    "sources": [
      {
        "title": "Getting High: The Adventures of Oasis",
        "url": "https://deanstreetpress.co.uk/pages/book_page/19"
      },
      {
        "title": "Major player in Oasis story emerges in wake of 'Supersonic' doc",
        "url": "https://www.sfchronicle.com/movies/article/Major-player-in-Oasis-story-emerges-in-wake-of-10630846.php?psid=cXpPr"
      },
      {
        "title": "The Recording Studios",
        "url": "http://www.oasis-recordinginfo.co.uk/?page_id=702"
      },
      {
        "title": "Mary McGuigan - Twitter",
        "url": "https://twitter.com/mary_mcguigan/status/1243667594453962753"
      },
      {
        "title": "Oasis Supersonic (US) Video",
        "url": "https://www.oasis-timeline.com/images/sources/oasis_supersonic_version_3_label.jpg"
      }
    ]
  },
  {
    "title": "(What's the Story) Morning Glory? Mixing Session",
    "notes": [
      "Mixing took place at Orinoco Studios in South East London, UK in-between festival gigs in mainland Europe.",
      "Paul Weller becomes involved after hearing the rough mixes on cassette tapes brought on the road to the gigs.  He records the solo on Champagne Supernova and the harmonica on The Swamp Song during the mixing session.",
      "Oasis began playing festival gigs in mainland Europe at the Roskilde Festival in Denmark on June 30, 1995 and returning to the UK play at Irvine Beach on July 14th, 1995. ",
      "Oasis and Paul Weller played on the same festival bill at the \"Out of the Green\" festival in Switzerland on July 7, 1995.",
      "Bonehead is photographed for the inner sleeve artwork for \"(What's the Story) Morning Glory?\" at Orinoco Studios some time after the two nights at Irvine Beach July 14-15, 1995.",
      "Session likely started some time late in June/early July 1995 and lasted for three weeks."
    ],
    "sources": [
      {
        "title": "Oasis Supersonic:  The Complete, Authorised and Uncut Interviews",
        "url": "https://www.headline.co.uk/titles/none/supersonic/9781472285461/"
      },
      {
        "title": "Microdot Blog - Inner Visions - Oasis 'Morning Glory' Packaging",
        "url": "https://www.microdotboutique.com/blogs/news/mg-inner"
      },
      {
        "title": "(What's the Story) Morning Glory? Tour",
        "url": "https://en.wikipedia.org/wiki/(What%27s_the_Story)_Morning_Glory%3F_Tour"
      }
    ]
  },
  {
    "title": "All Around the World Single Cover Shoot",
    "notes": [
      "Shot on a beach in Bournemouth, UK.",
      "Coincided with a football match between Bournemouth and Wigan Athletic.  The match was played on August 16, 1997 (a Saturday).",
      "According to Brian Cannon of Microdot Creative, the photo shoot would not have been on match day."
    ],
    "sources": [
      {
        "title": "Brian Cannon - Twitter",
        "url": "https://twitter.com/microdotcreativ/status/1253420517383524364E"
      }
    ]
  },
  {
    "title": "Recording Standing on the Shoulder of Giants",
    "notes": [
      "On October 5, 1998, Noel Gallagher begins a demo session at Wheeler End Studios for tracks that would later appear on the album.",
      "On February 16, 1999, a demo CD is created that includes ten songs (<i>Idler's Dream</i>, <i>One Way Road</i>, <i>Put Yer Money Where Yer Mouth Is</i>, <i>Sunday Morning Call</i>, <i>Just Gettin' Older</i>, <i>I Can See A Liar</i>, <i>Little James</i>, <i>One Way Road</i>, <i>Let There Be Love</i>).  The recording are most likely from the session(s) at Wheeler End Studios.",
      "On February 24, 1999, the band holds a rehearsal at the Music Bank in London to practice the new songs.",
      "In an interview in the February 1999 edition of Q Magazine, Noel Gallagher talks about the recording of the demo of <i>Go Let It Out</i>.",
      "In April, 1999, the main recording session for the album begins at Chateau De La Colle Noire in France.  According to engineer Jan \"Stan\" Kybert, the session lasted for 6 weeks.",
      "Jill Furmanovsky photographs Noel and Liam Gallagher during the recording session in France.  The date on the picture is May 21, 1999.",
      "Summer/Early Fall 1999 - Oasis finishes recording of the album at Wheeler End Studios in London, according to engineer Jan \"Stan\" Kybert.",
      "Bonehead and Guigsy quit the band in August, 1999 (9th and 25th respectively), possibly before the band returned to Wheeler End Studios to finish recording.",
      "Mixing of the album was done at Olympic Studios at Mark \"Spike\" Stent's studio.",
      "The album is mastered at Metropolis in London.",
      "Based on the information, the session in France most likely lasted from Monday April 12th to Friday May 21st, 1999."
    ],
    "sources": [
      {
        "title": "Mr. Monobrow - Standing on the Shoulder of Giants",
        "url": "https://monobrowdemos.wordpress.com/standing-on-the-shoulder-of-giants/"
      },
      {
        "title": "Noel Gallagher & Gem Archer - NME February 26, 2000",
        "url": "http://oasisinterviews.blogspot.com/2000/02/noel-gallagher-gem-archer-nme-26th.html"
      },
      {
        "title": "Rockarchive Edition 50 - Oasis",
        "url": "https://www.rockarchive.com/prints/o/oasis-oa082jf"
      }
    ]
  },
  {
    "title": "Recording Heathen Chemistry",
    "notes": [
      "Jan \"Stan\" Kybert demoed the album tracks at Wheeler End Studios in London.  Most of those demoes went on to become the actual record, as Oasis didn't use a producer.",
      "Some recording took place at Olympic Studios, but the bulk was done at Wheeler End Studios",
      "Most likely recorded between October 2001 and March 2002, though the later date may also include mixing and mastering."
    ],
    "sources": [
    ]
  },
  {
    "title": "The Hindu Times Music Video Shoot",
    "notes": [
      "Filmed at Abbey Road Studios and directed by WIZ (Andrew John Whiston).",
      "The video was released on April 4th, 2002.",
      "The band wrapped up recording of <i>Heathen Chemistry</i> some time in March 2002.",
      "Most likely filmed some time in March, 2002 as recording was wrapping up."
    ],
    "sources": [
      {
        "title": "IMDB - Oasis: The Hindu Times",
        "url": "https://www.imdb.com/title/tt7318296/"
      },
      {
        "title": "Sonic Editions - Liam At Abbey Road",
        "url": "https://www.soniceditions.com/image/liam-at-abbey-road"
      }
    ]
  }
]
