[
  {
    "title": "Swirl Logo Creation",
    "notes": [
      "The original Oasis Union Jack swirl logo is created by Tony French some time in the Spring of 1993.",
      "The logo is commissioned by Noel Gallagher for use on the <i>Live Demonstration</i> tape, which contains recordings from the the session at Porter Street Studio in Liverpool, UK with the Real People, also in the Spring of 1993.",
      "This all occurs prior to the famous King Tuts gig on May 31, 1993."
    ],
    "sources": [
      {
        "title": "Oasis Band Logo History by Brian Cannon",
        "url": "https://www.youtube.com/watch?v=y5gBUJEGHMw&t=77s"
      }
    ]
  },
  {
    "title": "Definitely Maybe Monnow Valley Recording Session",
    "notes": [
      "The band had gigs all the way up through December 16, 1993.",
      "Tony McCarroll states in his book that they were at Monnow Valley after they heard Columbia on the radio for the first time.  The white label demo was aired on December 6, 1993 on BBC Radio One.",
      "He also states that the session lasted 18 days.",
      "The band recorded Supersonic at The Pink Museum in Liverpool on December 19, 1993, so they wouldn't have been at Monnow Valley at that time.",
      "The band recorded a session for BBC Radio One on December 22, 1993 at Maida Vale Studios which was later broadcast on January 4th 1994.",
      "Liam Gallagher is on vacation in Tenerife, Spain from December 26th - 28th, 1993.",
      "The cover for Supersonic single was shot at Monnow Valley Studios on January 26, 1994.",
      "The band played their famous gig at Water Rats in London on January 27.",
      "Tentative dates for the session are January 7, 1994 to January 26, 1994."
    ],
    "sources": [
      {
        "title": "Oasis: The Truth",
        "url": "https://johnblakebooks.com/oasis-the-truth.html"
      }
    ]
  },
  {
    "title": "Definitely Maybe Sawmill Studios Recording Session",
    "notes": [
      "The band played their famous gig at Water Rats in London on January 27.",
      "The band didn't head to Sawmill Studios sometime until after the Water Rates gig.  Tony McCarroll states in his book that they went from London back to Manchester for one day and then down to Sawmill Studios.",
      "Paolo Hewitt states in Getting High that the band went to Olympic Studios to mix the Monnow Valley sessions for a couple days before they realized it wasn't going to work.",
      "Anjali Dutt (engineer on the sessions) stated that the Sawmill Studios session didn't start until after the Gleneagles gig (February 6th, 1994) AND the Amsterdam ferry incident (February 17th, 1994).",
      "Oasis resuming touring on March 23rd, 1994 in Bedford, UK.  Therefore, the sessions most likely ran from some time after February 17th until some time in mid-March.",
      "Tentative dates for the session are February 24, 1994 to March 4, 1994."
    ],
    "sources": [
      {
        "title": "Oasis Recording Info: It’s Getting Better: The Sawmills Sessions",
        "url": "http://www.oasis-recordinginfo.co.uk/?page_id=137"
      },
      {
        "title": "Getting High: The Adventures of Oasis",
        "url": "https://deanstreetpress.co.uk/pages/book_page/19"
      },
      {
        "title": "Oasis: The Truth",
        "url": "https://johnblakebooks.com/oasis-the-truth.html"
      }
    ]
  },
  {
    "title": "Shakermaker Video Shoot",
    "notes": [
      "The video is filmed at three distinct locations:  8 Stratford Avenue in Didsbury (Bonehead's old house), Fog Lane Park and obviously Sifter's Records, all of which are within a 2 mile radius of each other.",
      "There may even be a few shots in front of Noel and Liam's childhood house on Cranwell Drive in neighboring Burnage.",
      "Based on the flowers and grass visible during the shots in Bonehead's back garden, the video appears to have been filmed in the springtime or early summer, 1994.",
      "A check of the band's touring schedule shows that they were on a break from May 15th to June 1, 1994.  They were also on a break from April 14th to April 28th, 1994, but based on the greenery in the video, I am guessing the May timeline makes more sense.",
      "The cover to Definitely Maybe is photographed on May 27th at Bonehead's house, so the video shoot would have been on a different day and quite possibly around the same time for logistical reasons.",
      "The video was released on June 13th.  As this was their second music video and prior to the release of Definitely Maybe, it most likely did not have a huge budget and was probably filmed in one day.",
      "Likely filming date is some time during the last week of May, 1994"
    ],
    "sources": [

    ]
  },
  {
    "title": "Shakermaker Single Cover Shoot",
    "notes": [
      "Shot in Michael Spencer Jones' apartment on Clyde Road, West Didsbury, Manchester, UK in the Spring of 1994."
    ],
    "sources": [
      {
        "title": "Oasis photographer Michael Spencer Jones: how it started, photographing Shakermaker cover",
        "url": "https://www.youtube.com/watch?v=QnXfSJ1el0E"
      }
    ]
  },
  {
    "title": "Supersonic (US) Video Shoot",
    "notes": [
      "Parts of the video were shot at the Cabazon Dinosaurs in Cabazon, CA (east of Lost Angeles near Palm Springs, CA).",
      "As part of the US tour, Oasis arrived in Los Angeles, CA on either September 27th or 28th ahead of the show at the Whiskey A Go Go.",
      "Epic Records throws a party for Oasis on the afternoon of the Whiskey A Go Go gig (September 29th, 1994).",
      "Oasis played there ill-fated concert at the Whiskey A Go Go on September 29, 1994.",
      "At some point during the tour, Gugisy sends his sister Mary a post card mentioning that the band just filmed the music video.  However, the only visible postcard has an October 6th postmark.",
      "Noel Gallagher famously quits the band that night and spends at least 3 days in San Francisco with Melissa Lim.",
      "Noel Gallagher goes to Las Vegas, NV with Tim Abbot of Creation Records for a few more days.",
      "Oasis took part in a recording session at The Congress House in Austin, TX on October 8, 1994 after Noel rejoined the band.",
      "Oasis US tour resumed in Minneapolis, MN on October 14th, 1994.",
      "The music video is released on November 15th, 1994."
    ],
    "sources": [
      {
        "title": "Getting High: The Adventures of Oasis",
        "url": "https://deanstreetpress.co.uk/pages/book_page/19"
      },
      {
        "title": "Major player in Oasis story emerges in wake of 'Supersonic' doc",
        "url": "https://www.sfchronicle.com/movies/article/Major-player-in-Oasis-story-emerges-in-wake-of-10630846.php?psid=cXpPr"
      },
      {
        "title": "The Recording Studios",
        "url": "http://www.oasis-recordinginfo.co.uk/?page_id=702"
      },
      {
        "title": "Mary McGuigan - Twitter",
        "url": "https://twitter.com/mary_mcguigan/status/1243667594453962753"
      },
      {
        "title": "Oasis Supersonic (US) Video",
        "url": "https://www.oasis-timeline.com/images/sources/oasis_supersonic_version_3_label.jpg"
      }
    ]
  }
]